# Расчет узкополосного ПФ на ОУ. Картер - ОУ для всех; п. 21.5; рис. 21.9; стр. 364

# Входные данные
$F = 700;
$C1 = $C2 = 0.000001;

# Расчет
$R1 = $R4 = 1 / (2 * [System.Math]::PI * $C1 * $F);
$R3 = 19 * $R1;
$R2 = $R1 / 19;
$CoutMin = 100 * $C1;
$CoutMax = 1000 * $C1;

# Вывод
"C1 = C2 = " + $C1 * 1e6 + " мкФ";
"R1 = R4 = " + [System.Math]::Round($R1, 0) + " Ом";
"R3 = " + [System.Math]::Round($R3, 0) + " Ом";
"R2 = " + [System.Math]::Round($R2, 0) + " Ом";
"Cout = " + $CoutMin * 1e6 + " ... " + $CoutMax *1e6 + " мкФ";